In [2]:
load_ext sql

In [3]:
%sql mysql+pymysql://root:easwari@localhost

In [3]:
%%sql
SHOW DATABASES;

 * mysql+pymysql://root:***@localhost
16 rows affected.

[('employees',),
 ('events',),
 ('functions',),
 ('information_schema',),
 ('joins',),
 ('joins interview',),
 ('mysql',),
 ('performance_schema',),
 ('sales',),
 ('set operations',),
 ('students',),
 ('subqueries',),
 ('sys',),
 ('triggers',),
 ('window functions interview questuions',),
 ('window_functions',)]

In [4]:
%%sql
use joins;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [6]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost
17 rows affected.

[('customers',),
 ('departments',),
 ('employees',),
 ('employees1',),
 ('employees2',),
 ('numbers',),
 ('numbers2',),
 ('orders',),
 ('productdelivery',),
 ('products',),
 ('regions',),
 ('salaries',),
 ('students',),
 ('table-a',),
 ('table-b',),
 ('table1',),
 ('table2',)]

In [7]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Janani'), (2, 'Lavanya'), (3, 'Jaanu'), (4, 'Lakshith'), (5, 'Sanjana')]

In [8]:
%%sql
select * from departments;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'HR'), (2, 'Finance'), (3, 'IT'), (4, 'Marketing'), (5, 'Sales')]

In [9]:
%%sql
select * from salaries;

 * mysql+pymysql://root:***@localhost
16 rows affected.

[(1, 60000, datetime.date(2023, 1, 1)),
 (1, 61000, datetime.date(2023, 2, 1)),
 (1, 62000, datetime.date(2023, 3, 1)),
 (1, 63000, datetime.date(2023, 4, 1)),
 (1, 64000, datetime.date(2023, 5, 1)),
 (2, 65000, datetime.date(2023, 1, 1)),
 (2, 66000, datetime.date(2023, 2, 1)),
 (2, 67000, datetime.date(2023, 3, 1)),
 (2, 68000, datetime.date(2023, 4, 1)),
 (2, 69000, datetime.date(2023, 5, 1)),
 (3, 70000, datetime.date(2023, 1, 1)),
 (3, 71000, datetime.date(2023, 2, 1)),
 (3, 72000, datetime.date(2023, 3, 1)),
 (3, 73000, datetime.date(2023, 4, 1)),
 (3, 74000, datetime.date(2023, 5, 1)),
 (3, 90000, datetime.date(2024, 1, 1))]

--> find the most recent of all employees

In [11]:
%%sql
SELECT `e`.*,`s`.*
FROM (employees `e`) INNER JOIN (salaries `s`)
on `e`.emp_no = `s`.emp_no;

 * mysql+pymysql://root:***@localhost
16 rows affected.

[(1, 'Janani', 1, 60000, datetime.date(2023, 1, 1)),
 (1, 'Janani', 1, 61000, datetime.date(2023, 2, 1)),
 (1, 'Janani', 1, 62000, datetime.date(2023, 3, 1)),
 (1, 'Janani', 1, 63000, datetime.date(2023, 4, 1)),
 (1, 'Janani', 1, 64000, datetime.date(2023, 5, 1)),
 (2, 'Lavanya', 2, 65000, datetime.date(2023, 1, 1)),
 (2, 'Lavanya', 2, 66000, datetime.date(2023, 2, 1)),
 (2, 'Lavanya', 2, 67000, datetime.date(2023, 3, 1)),
 (2, 'Lavanya', 2, 68000, datetime.date(2023, 4, 1)),
 (2, 'Lavanya', 2, 69000, datetime.date(2023, 5, 1)),
 (3, 'Jaanu', 3, 70000, datetime.date(2023, 1, 1)),
 (3, 'Jaanu', 3, 71000, datetime.date(2023, 2, 1)),
 (3, 'Jaanu', 3, 72000, datetime.date(2023, 3, 1)),
 (3, 'Jaanu', 3, 73000, datetime.date(2023, 4, 1)),
 (3, 'Jaanu', 3, 74000, datetime.date(2023, 5, 1)),
 (3, 'Jaanu', 3, 90000, datetime.date(2024, 1, 1))]

In [14]:
%%sql
SELECT `e`.*,`s`.salary, `s`.from_date,
ROW_NUMBER() OVER(PARTITION BY `e`.emp_no ORDER BY `s`.from_date DESC) as `row_number`
FROM (employees `e`) INNER JOIN (salaries `s`)
on `e`.emp_no = `s`.emp_no;

 * mysql+pymysql://root:***@localhost
16 rows affected.

[(1, 'Janani', 64000, datetime.date(2023, 5, 1), 1),
 (1, 'Janani', 63000, datetime.date(2023, 4, 1), 2),
 (1, 'Janani', 62000, datetime.date(2023, 3, 1), 3),
 (1, 'Janani', 61000, datetime.date(2023, 2, 1), 4),
 (1, 'Janani', 60000, datetime.date(2023, 1, 1), 5),
 (2, 'Lavanya', 69000, datetime.date(2023, 5, 1), 1),
 (2, 'Lavanya', 68000, datetime.date(2023, 4, 1), 2),
 (2, 'Lavanya', 67000, datetime.date(2023, 3, 1), 3),
 (2, 'Lavanya', 66000, datetime.date(2023, 2, 1), 4),
 (2, 'Lavanya', 65000, datetime.date(2023, 1, 1), 5),
 (3, 'Jaanu', 90000, datetime.date(2024, 1, 1), 1),
 (3, 'Jaanu', 74000, datetime.date(2023, 5, 1), 2),
 (3, 'Jaanu', 73000, datetime.date(2023, 4, 1), 3),
 (3, 'Jaanu', 72000, datetime.date(2023, 3, 1), 4),
 (3, 'Jaanu', 71000, datetime.date(2023, 2, 1), 5),
 (3, 'Jaanu', 70000, datetime.date(2023, 1, 1), 6)]

In [15]:
%%sql
WITH `cte` as
(
SELECT `e`.*,`s`.salary, `s`.from_date,
ROW_NUMBER() OVER(PARTITION BY `e`.emp_no ORDER BY `s`.from_date DESC) as `row_number`
FROM (employees `e`) INNER JOIN (salaries `s`)
on `e`.emp_no = `s`.emp_no
)
SELECT *
FROM `cte`
WHERE `row_number` = 1;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[(1, 'Janani', 64000, datetime.date(2023, 5, 1), 1),
 (2, 'Lavanya', 69000, datetime.date(2023, 5, 1), 1),
 (3, 'Jaanu', 90000, datetime.date(2024, 1, 1), 1)]

--> CREATE A {VIEW} NAMED (`employees_most_recent_salaries`)
--> WHICH SHOULD CONTAINS --> (all employees most recent salaries)

In [16]:
%%sql
CREATE VIEW `employees_most_recent_salaries` as
WITH `cte` as
(
SELECT `e`.*,`s`.salary, `s`.from_date,
ROW_NUMBER() OVER(PARTITION BY `e`.emp_no ORDER BY `s`.from_date DESC) as `row_number`
FROM (employees `e`) INNER JOIN (salaries `s`)
on `e`.emp_no = `s`.emp_no
)
SELECT *
FROM `cte`
WHERE `row_number` = 1;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

--> SELECT (ALL THE DATA) IN {VIEW} --> JUST LIKE (SELECTING ALL DATA) IN {TABLE}

In [5]:
%%sql
SELECT * FROM `employees_most_recent_salaries`;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[(1, 'sanjay', 64000, datetime.date(2023, 5, 1), 1),
 (2, 'lavanya', 69000, datetime.date(2023, 5, 1), 1),
 (3, 'jaanu', 90000, datetime.date(2024, 1, 1), 1)]

--> we can {alter view} by using {create or replace view} instead of drop that view and creatng again

--> alter the view employees_most_recent_salaries so that it can retrieve 2 recent salaries of employees

In [6]:
%%sql

CREATE OR REPLACE VIEW `employees_most_recent_salaries` as
WITH `cte` as
(
SELECT `e`.*,`s`.salary, `s`.from_date,
ROW_NUMBER() OVER(PARTITION BY `e`.emp_no ORDER BY `s`.from_date DESC) as `row_number`
FROM (employees `e`) INNER JOIN (salaries `s`)
on `e`.emp_no = `s`.emp_no
)
SELECT *
FROM `cte`
WHERE `row_number` in(1,2);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [7]:
%%sql
SELECT * FROM `employees_most_recent_salaries`;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 'sanjay', 64000, datetime.date(2023, 5, 1), 1),
 (1, 'sanjay', 63000, datetime.date(2023, 4, 1), 2),
 (2, 'lavanya', 69000, datetime.date(2023, 5, 1), 1),
 (2, 'lavanya', 68000, datetime.date(2023, 4, 1), 2),
 (3, 'jaanu', 90000, datetime.date(2024, 1, 1), 1),
 (3, 'jaanu', 74000, datetime.date(2023, 5, 1), 2)]